[{"id": "view", "title": "Data Scientist (L5) - Content", "company": "Netflix", "location": "United States", "url": "https://www.linkedin.com/jobs/view/data-scientist-l5-content-at-netflix-4179694651", "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.TUDUM is Netflix’s home for fans, where our daily breaking news, original videos, exclusive interviews, and behind-the-scenes storytelling reach millions of fans every month. We aim to bring members joy by deepening their connections to their favorite movies and series and helping them discover their next obsession.Data is a crucial component in shaping TUDUM’s strategy. In Content & Conversation Applied Science and Analytics (CASAS) DSE, we focus on delivering data products and insights that support our business partners in their complex and nuanced decision-making processes. We are a highly collaborative team that partners across Netflix to drive impact.We are seeking a talented Senior Data Scientist to provide key insights and thought partnership to our TUDUM decision makers. You will generate insights by scoping and executing deep dive analysis and experimentation with the TUDUM product, engineering, and editorial teams. In success, you will collaborate on existing priorities but also will propose and execute on new opportunities. This role features ample opportunity for project ownership, leadership and direct influence on impactful business decisions.In This Role, You WillBe a strategic thought partner with business stakeholders to define high impact problems and innovative ways to solve them with data.Develop statistical models explaining TUDUM engagement, impact, and other key behavioral patterns and drive causal inferences between TUDUM and the engagement with other netflix channelsTranslate insights into actionable recommendations for business improvement, and communicate these findings clearly to a broad audienceIdentify and proactively socialize TUDUM insights, especially those that may be impactful to other business areasWhat You’ll BringExceptional interpersonal and communication skills to influence stakeholders using clear insights and recommendationsAdept at cultivating strong partnershipsExceptional thought partnership and engagement abilities with a diverse set of stakeholders and passionate about communicating difficult concepts to non-technical audiencesHighly skilled in leading through influenceExceptional facilitation, planning and organization skillsStrong statistical knowledge: understanding of predictive modeling; ability to tease out incrementality vs. correlations, confounder identification and amelioration, etc.Strong understanding of experimentation including power calculations and interpretation of resultsStrong SQL skills and experience with distributed analytic processing technologies (S3, Presto, Hive & Spark)Strong skills in Python or RSelf-starter who thrives under a high level of autonomy.Enthusiastic about Netflix cultureOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.", "requirements": ["Be a strategic thought partner with business stakeholders to define high impact problems and innovative ways to solve them with data.", "Develop statistical models explaining TUDUM engagement, impact, and other key behavioral patterns and drive causal inferences between TUDUM and the engagement with other netflix channels", "Translate insights into actionable recommendations for business improvement, and communicate these findings clearly to a broad audience", "Identify and proactively socialize TUDUM insights, especially those that may be impactful to other business areas", "Exceptional interpersonal and communication skills to influence stakeholders using clear insights and recommendations", "Adept at cultivating strong partnerships", "Exceptional thought partnership and engagement abilities with a diverse set of stakeholders and passionate about communicating difficult concepts to non-technical audiences", "Highly skilled in leading through influence", "Exceptional facilitation, planning and organization skills", "Strong statistical knowledge: understanding of predictive modeling; ability to tease out incrementality vs. correlations, confounder identification and amelioration, etc."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:36:41.443736"}, {"id": "view", "title": "Data Scientist (L5) - Netflix Preview Club", "company": "Netflix", "location": "United States", "url": "https://www.linkedin.com/jobs/view/data-scientist-l5-netflix-preview-club-at-netflix-4211646000", "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.Our mission to entertain the world is anchored in our content, and data is a crucial component in shaping our comprehensive content strategy. We focus on creating data products that support our content partners in their complex and nuanced decision-making processes. We are a highly collaborative team that partners across Netflix to drive impact.As a Data Scientist focusing on Netflix Preview Club, you'll be at the forefront of leveraging Netflix's best-in-class audience analytics to support our creative teams.What You’ll DoCollaborate closely with data scientists, consumer insights scientists, engineers, strategy partners, and our content teams to deliver insights through statistical modeling that drive key decisions.Develop measurement frameworks and statistical modeling frameworks in a mixed behavioral and survey context, to aid stakeholders in making complex, creative decisions.Be a strategic thought partner with stakeholders to define high-impact analytical problems and innovative ways to solve them with data.Drive product innovation through robust measurement strategies in experimentation, modeling, and analytics.Lead the design, analysis, and interpretation of experiments that shape the future of content analytics.What We’re Looking ForAdvanced degree in Statistics, Mathematics, Behavioral Economics, Mathematical Psychology, Cognitive Science, or related quantitative field.Strong statistical knowledge and intuition that you have used in building complex (Bayesian or related) psychometric models in human evaluation or related contexts.Several years of applied experience in an industry setting.Strong SQL skills and Quantitative Programming skills in Python or R.Ability to communicate technical and statistical concepts clearly and concisely among audiences at many different levels of technical depth.Self-starter who thrives under a high level of autonomy and who has the ability to adapt to changing circumstances and handle multiple priorities.Good judgment to balance between addressing stakeholder needs and investing in scalable solutions to serve general use cases. Ability to coordinate multiple workstreams, and prioritize multiple experiments.Exceptional interpersonal and communication skills.Enthusiastic about Netflix culture.Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.Netflix is a unique culture and environment. Learn more here.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.", "requirements": ["Collaborate closely with data scientists, consumer insights scientists, engineers, strategy partners, and our content teams to deliver insights through statistical modeling that drive key decisions.", "Develop measurement frameworks and statistical modeling frameworks in a mixed behavioral and survey context, to aid stakeholders in making complex, creative decisions.", "Be a strategic thought partner with stakeholders to define high-impact analytical problems and innovative ways to solve them with data.", "Drive product innovation through robust measurement strategies in experimentation, modeling, and analytics.", "Lead the design, analysis, and interpretation of experiments that shape the future of content analytics.", "Advanced degree in Statistics, Mathematics, Behavioral Economics, Mathematical Psychology, Cognitive Science, or related quantitative field.", "Strong statistical knowledge and intuition that you have used in building complex (Bayesian or related) psychometric models in human evaluation or related contexts.", "Several years of applied experience in an industry setting.", "Strong SQL skills and Quantitative Programming skills in Python or R.", "Ability to communicate technical and statistical concepts clearly and concisely among audiences at many different levels of technical depth."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:36:47.436115"}, {"id": "view", "title": "Data Scientist, GTM", "company": "Notion", "location": "San Francisco, CA", "url": "https://www.linkedin.com/jobs/view/data-scientist-gtm-at-notion-4214365517", "description": "About UsWe're on a mission to make it possible for every person, team, and company to be able to tailor their software to solve any problem and take on any challenge. Computers may be our most powerful tools, but most of us can't build or modify the software we use on them every day. At Notion, we want to change this with focus, design, and craft.We've been working on this together since 2016, and have customers like OpenAI, Toyota, Figma, Ramp, and thousands more on this journey with us. Today, we're growing fast and excited for new teammates to join us who are the best at what they do. We're passionate about building a company as diverse and creative as the millions of people Notion reaches worldwide.Notion is an in person company, and currently requires its employees to come to the office for two Anchor Days (Mondays & Thursdays) and requests that employees spend the majority of their week in the office (including a third day).About The RoleAs our Data Scientist for Go-to-Market, you will be a key business partner to our Sales and Revenue Operations team. Your work will be instrumental in shaping our data strategy as we design and implement abest-in-classGo-to-Market motion. From exploring what successful customer accounts look like to creating sales pipeline forecasts, your insights will directly impact business decisions and strategy. Each day will bring new challenges and opportunities to drive meaningful change with data.What You'll AchieveYou will partner with Revenue Operations and Sales leads, driving forward all data science and analytics work in their functional areasYou will transform complex data into compelling insights, synthesizing them into crisp narratives for senior leadership that drive measurable business change (Insights are useful. Impact is even better!)You will build and maintain KPI dashboards that teams rely on for critical decision-making, along with self-service tools that empower business partnersYou will develop models that become core to our operations, such as optimizing sales outreach strategies or building a sales forecasting modelYou will collaborate closely with our Data Engineering and Business Systems teams to build high-fidelity, canonical customer data pipelines that serve as the foundation for GTM analyticsSkills You'll Need To BringYou've spent meaningful time as data scientist partnering with business functions such as Revenue Operations, Finance, Growth, MarketingYou are comfortable with ambiguity and motivated by business resultsYou have expertise in SQL, and least one scripting language (Python or R)You are comfortable transforming raw data to build your own data sets if they don't exist yetYou can effectively communicate data insights and transform them into stories that drive business impactYou have strong communication and collaboration skills while working in cross-functional environmentsYou have a bias for using the right tools to get a job done with maximum efficiency. You have experience making tradeoffs between speed and accuracyNice To HavesExperience working directly with Sales, Customer Success, Revenue Operations, and/or Finance teamsBackground at a high-growth B2B SaaS startupFamiliarity with our product (being a current Notion user would be great!)We hire talented and passionate people from a variety of backgrounds because we want our global employee base to represent the wide diversity of our customers. If you’re excited about a role but your past experience doesn’t align perfectly with every bullet point listed in the job description, we still encourage you to apply. If you’re a builder at heart, share our company values, and enthusiastic about making software toolmaking ubiquitous, we want to hear from you.Notion is proud to be an equal opportunity employer. We do not discriminate in hiring or any employment decision based on race, color, religion, national origin, age, sex (including pregnancy, childbirth, or related medical conditions), marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or other applicable legally protected characteristic. Notion considers qualified applicants with criminal histories, consistent with applicable federal, state and local law. Notion is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, please let your recruiter know.Notion is committed to providing highly competitive cash compensation, equity, and benefits. The compensation offered for this role will be based on multiple factors such as location, the role’s scope and complexity, and the candidate’s experience and expertise, and may vary from the range provided below. For roles based in San Francisco, the estimated base salary range for this role is $140,000 - $170,000 per year.By clicking “Submit Application”, I understand and agree that Notion and its affiliates and subsidiaries will collect and process my information in accordance with Notion’s Global Recruiting Privacy Policy.", "requirements": ["You will partner with Revenue Operations and Sales leads, driving forward all data science and analytics work in their functional areas", "You will transform complex data into compelling insights, synthesizing them into crisp narratives for senior leadership that drive measurable business change (Insights are useful. Impact is even better!)", "You will build and maintain KPI dashboards that teams rely on for critical decision-making, along with self-service tools that empower business partners", "You will develop models that become core to our operations, such as optimizing sales outreach strategies or building a sales forecasting model", "You will collaborate closely with our Data Engineering and Business Systems teams to build high-fidelity, canonical customer data pipelines that serve as the foundation for GTM analytics", "You've spent meaningful time as data scientist partnering with business functions such as Revenue Operations, Finance, Growth, Marketing", "You are comfortable with ambiguity and motivated by business results", "You have expertise in SQL, and least one scripting language (Python or R)", "You are comfortable transforming raw data to build your own data sets if they don't exist yet", "You can effectively communicate data insights and transform them into stories that drive business impact"], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:36:52.645657"}, {"id": "view", "title": "Data Scientist (L5) - Member Algorithm Foundations", "company": "Netflix", "location": "United States", "url": "https://www.linkedin.com/jobs/view/data-scientist-l5-member-algorithm-foundations-at-netflix-4138391092", "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.As Netflix expands into delivering a broader range of entertainment options and business models, it is increasingly important we build a holistic and personal view of who our consumers are. We are looking for a Senior Data Scientist to support the vision, strategies, understanding, and development of Machine Learning systems that provide intelligence about our consumers. This high-impact role will be pivotal in uncovering opportunities, influencing product decisions, and informing future directions. The ideal candidate will excel in opportunity discovery, experimentation, cross-functional & cross-domain collaboration and have a passion for leveraging their ML knowledge to continuously improve our understanding of our members.In This Role, You WillBe a strong thought partner influencing strategic decision-making through data-driven insights and recommendations.Proactively identify and perform data exploration to inform future product directions.Make data-driven recommendations for opportunities, prioritization, and resource allocation.Understand where various opportunities fit into the broader strategies and prioritize competing demands to ensure the most impactful items.Effectively identify and leverage machine learning, experimentation, and other analysis techniques, as appropriate, to solve business problems.Develop and validate the appropriate metrics to measure success in a given product area.Cultivate strong partnerships with cross-functional partners from product, engineering, design, consumer research, etc.Cultivate strong partnerships with cross-domain partners from Content, Ads, Games, Personalization, etc.Present your research and insights to all levels of the company.You AreA highly skilled professional with strong product knowledge and intuition, ideally applied in consumer product development settings.Demonstrated expertise in machine learning methodologies, both with regards to building ML systems, as well as sharing understandings about what systems are doing.Proficient in a quantitative programming language, such as Python.Highly effective in engaging with diverse stakeholders and adept at cultivating strong partnerships.Excellent with communication, conveying technical content to non-technical audiences, and collaborating across different functions to ensure real business impact.Strategic-minded, impact-driven, and able to incorporate a larger business context into data questions and product development.Passionate about driving and influencing product strategies in a fast-paced, cross-functional environment.Comfortable with ambiguity, demonstrating the capability to thrive with minimal oversight and navigate complex processes.Our compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for this role is $170,000 - $720,000.Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.Netflix is a unique culture and environment. Learn more here.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.", "requirements": ["Be a strong thought partner influencing strategic decision-making through data-driven insights and recommendations.", "Proactively identify and perform data exploration to inform future product directions.", "Make data-driven recommendations for opportunities, prioritization, and resource allocation.", "Understand where various opportunities fit into the broader strategies and prioritize competing demands to ensure the most impactful items.", "Effectively identify and leverage machine learning, experimentation, and other analysis techniques, as appropriate, to solve business problems.", "Develop and validate the appropriate metrics to measure success in a given product area.", "Cultivate strong partnerships with cross-functional partners from product, engineering, design, consumer research, etc.", "Cultivate strong partnerships with cross-domain partners from Content, Ads, Games, Personalization, etc.", "Present your research and insights to all levels of the company.", "A highly skilled professional with strong product knowledge and intuition, ideally applied in consumer product development settings."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:36:59.267126"}, {"id": "view", "title": "Data Scientist", "company": "Warner Music Group", "location": "New York, NY", "url": "https://www.linkedin.com/jobs/view/data-scientist-at-warner-music-group-4197998463", "description": "Job Description:At Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter. We are guided by four core principles that underpin everything we do across all our diverse businesses:Curiosity: We do our best work when we’re immersing ourselves in culture and breaking through barriers. Curiosity is the driving force behind creativity and ingenuity. It fuels innovation, and innovation is the key to our future.Collaboration: Making music and bringing it to the world is all about the power of originality amplified by teamwork. A great idea, like a great song, travels globally. We ignite passions and build connections across our diverse community of artists, songwriters, partners, and fans.Commitment: We pursue excellence for our team and our talent. Everything in music starts with a leap into the unknown, and we’re committed to keeping the faith, acting with integrity, and delivering on our promises.WMG is home to a wide range of artists, musicians, and songwriters that fuel our success. That is why we are committed to creating a work environment that actively values, appreciates, and respects everyone. We encourage applications from people with a wide variety of backgrounds and experiences.Consider a career at WMG and get the best of both worlds – an innovative global music company that retains the creative spirit of a nimble independent.A little bit about our team:WMG’s Business Intelligence team (BI) works to influence WMG’s strategy and day-to-day operations by developing thoughtful insights & intelligence from its core business practices. The Data Scientist will work with various departments across Warner Music’s Central Functions, Recorded Music, & Music Publishing Divisions to understand the trends and dynamics that drive the constant evolution of our business. Our goal for this role is to strengthen our analytical power and bring improved rigor to the insights we deliver to our family of labels and operators. We work with partners across the company to establish best practices for breaking artists and sustaining catalog repertoire across consumption platforms, gauge the impact of marketing initiatives and campaigns, and work to understand user behavior around the world.Your role:Intelligence is the lifeblood of today’s music business, and in this role you’ll get a chance to apply your creativity and problem-solving skills to help our labels and artists connect with consumers across an array of media and mediums. Because the BI team works closely with departments across the company, the Data Scientist will have the opportunity to see the inner workings and decision-making within a global music company - and the ability to influence those decisions with thoughtful intelligence work. We’re a collaborative team that loves learning new things, sharing ideas, thinking about the future of the music industry – and helping our company get there.Here you’ll get to:Lead data science projects from inception to completion on topics such as subscriber consumption and revenue forecasts, digital advertising forecasts, global trends analysis, business performance trends, and more.Apply advanced data analysis and statistical modeling techniques to address complex business challenges. Develop and maintain production-level models, ensuring accuracy and efficiency.Work closely with Business Intelligence, Strategy, Corporate Finance, and operators to understand business needs, and provide actionable insights to a diverse audience across the business.Proactively identify areas where data science can add value by experimenting with different hypotheses and techniques to improve existing processes and techniques within the BI team.Utilize advanced tools and frameworks for data analysis, modeling, and visualization.Promote and participate in a culture of continuous learning within the team by providing feedback, sharing knowledge, and mentoring more junior team members.About you:Bachelor’s, Master’s, or PhD in Economics, Econometrics, Statistics, Data Science, Applied Mathematics, or a related field.3-5 years of full-time post-graduation experience applying econometric and statistical methods in a business setting, preferably within the music, entertainment, or digital media industry.Proven experience working with and analyzing macroeconomic and industry-level data from globally-trusted third-party sources like the UN, IMF, OECD, and World Bank.Demonstrated ability to independently lead and execute data science projects that require rigorous statistical and econometric analysis.Demonstrated ability to lead and execute data science projects with minimal supervision.Proficiency in programming languages such as Python or R for data analysis and model development.Experience with machine learning frameworks and statistical tools.Strong understanding of SQL and working with large datasets.Familiarity with data visualization tools like Tableau or Power BI.Expertise in fundamental data analysis, machine learning, and statistical modeling techniques.Ability to quickly learn and adapt to new techniques and technologies.Excellent communication skills, with the ability to explain complex concepts to non-technical stakeholders.Strong problem-solving abilities, with a bias towards action and a proactive approach to identifying opportunities and challenges.We’d love it if you also had:Familiarity with the streaming music landscape or other digital mediaExperience building analytical products and dashboards within BI software like Tableau or other environments like StreamlitAbout us:As the home to 10K Projects, 300 Elektra, Asylum, Atlantic, East West, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Rhino, Roadrunner, Sire, Warner Records, Warner Classics, and several other of the world’s premier recording labels, Warner Music Group champions emerging artists and global superstars alike. And our renowned publishing company, Warner Chappell Music, represents genre-spanning songwriters and producers through a catalogue of more than one million copyrights worldwide. Warner Music Group is also home to ADA, which supports the independent community, as well as artist services division WMX. In addition, WMG counts film and television storytelling powerhouse Warner Music Entertainment among its many brands.Together, we are Warner Music Group: Music With Vision & Voice.Love this job and want to apply?Click the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.Don’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.Thanks for your interest in working for WMG. We love it here, and think you will, too.andEffective October 1st, this position will require being in the office 4 days a week. We believe that an in-office presence is critical for talent development, collaboration and building strong relationships.Salary Range$150,000 - $160,000 AnnuallySalary ranges are included for job postings where required by law. The actual base pay is dependent upon many factors, such as work experience and business needs. The pay range is subject to change at any time dependent on a variety of internal and external factors.WMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.Copyright © 2025 Warner Music Inc.Links to relevant documents:2025 Benefits At A Glance final.pdfEVerify Participation Poster.pdfRight To Work .pdf", "requirements": ["Curiosity: We do our best work when we’re immersing ourselves in culture and breaking through barriers. Curiosity is the driving force behind creativity and ingenuity. It fuels innovation, and innovation is the key to our future.", "Collaboration: Making music and bringing it to the world is all about the power of originality amplified by teamwork. A great idea, like a great song, travels globally. We ignite passions and build connections across our diverse community of artists, songwriters, partners, and fans.", "Commitment: We pursue excellence for our team and our talent. Everything in music starts with a leap into the unknown, and we’re committed to keeping the faith, acting with integrity, and delivering on our promises.", "Lead data science projects from inception to completion on topics such as subscriber consumption and revenue forecasts, digital advertising forecasts, global trends analysis, business performance trends, and more.", "Apply advanced data analysis and statistical modeling techniques to address complex business challenges. Develop and maintain production-level models, ensuring accuracy and efficiency.", "Work closely with Business Intelligence, Strategy, Corporate Finance, and operators to understand business needs, and provide actionable insights to a diverse audience across the business.", "Proactively identify areas where data science can add value by experimenting with different hypotheses and techniques to improve existing processes and techniques within the BI team.", "Utilize advanced tools and frameworks for data analysis, modeling, and visualization.", "Promote and participate in a culture of continuous learning within the team by providing feedback, sharing knowledge, and mentoring more junior team members.", "Bachelor’s, Master’s, or PhD in Economics, Econometrics, Statistics, Data Science, Applied Mathematics, or a related field."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:04.009333"}, {"id": "view", "title": "Software Engineer", "company": "Moment", "location": "New York City Metropolitan Area", "url": "https://www.linkedin.com/jobs/view/software-engineer-at-moment-4194409845", "description": "FULL-TIME | NYC (IN-PERSON)About MomentMomentis revolutionizing the largest asset class in the world.Founded in 2022 by former fixed income quants at leading prop shops, Moment is already the leading fixed income infrastructure provider for global fintechs, traditional brokerages, wealth platforms, and RIAs.Fixed income has evolved rapidly. Electronic trading volume has nearly doubled in the past three years. Retail fixed income volume has exploded—up more than 1500% in just two years. But the wealth space is largely still confined to legacy tech that doesn’t meet its needs anymore.That’s where Moment comes in. In weeks—not months or years—we enable customers to launch a seamless, modern fixed income solution through a simple set of APIs across:Data & AnalyticsAutomated ExecutionAutomated Portfolio Optimization & ManagementMost startups work their way up from small businesses. We did the opposite. In just a year, we've scaled toover $1.5 trillion in assets—and we’re just getting started. Backed by$56M+ from top-tier investors,our team is sharp, humble, ridiculously fast, and genuinely fun to work with. We’re growing like crazy. We’re looking for the best. Come build with us.The RoleWe are looking for talented software engineers to join our team as early members. You will work alongside some of the brightest people in the industry to develop the next generation of well-architected, robust, and scalable systems. Our engineering-driven culture is committed to delivering elegant and functional solutions to customers.The ideal candidate will possess:Experience in a fast-paced, engineering-focused organization.A mindset to challenge conventions and continuously improve.Willingness to build systems processing over 5 billion messages daily, ensuring reliability and scalability are paramount at Moment. These factors will significantly influence our product architecture and development.Ability to own large features and drive scaling efforts to deliver on our commitment to serve billions of investors globally.A fintech background is preferred but not required. We value a passion for revolutionizing how retail investors access capital markets. While an interest in finance is appreciated, we will provide comprehensive domain knowledge training during onboarding. Together, we aim to redefine and transform the finance industry.ResponsibilitiesDesign, develop, and maintain core Trading services that drive Moment's product offerings.Lead the scope definition, design, implementation, and deployment of robust distributed services, striking the appropriate balance between reliability, throughput, latency, resiliency, engineering velocity, and cost.Actively participate in design and architecture reviews for new features, products, or infrastructure components.Produce comprehensive documentation throughout all project lifecycle phases.Contribute to the evolution of our tech stack as we scale our product.Assist in building a world-class team by participating in hiring and mentoring new team members.Preferred Qualifications5-10+ years of experience in backend engineering.Proven ability to architect or build 0-1 services in a large-scale production environment.Hands-on experience in building distributed systems in a cloud environment using AWS.Proficiency in event-driven systems leveraging Kafka or similar messaging frameworks.Familiarity with Go or C++/Java programming languages.Working knowledge of Postgres database management system.Working experience in any OMS or EMS is strongly preferredImpact-oriented mindset, driving projects to success within Moment and beyond.Commitment to maintaining high standards for self and others when working with production systems.Open communication skills, including asking questions, assuming good intentions, and prioritizing transparency.Rigorous and empathetic approach, thriving in a collaborative and high-performance environment.Compensation & BenefitsFor this role, the salary range is $175,000-$225,000. Actual compensation will vary based on skills and experience.In addition to a competitive salary and equity package, we provide every employee with:Ability to grow into the leader you aspire to be. At a fast-growing company in an expanding industry, you can enjoy unmatched career growthEducation is encouraged with our company-wide professional development programs and course reimbursementsComprehensive wellness package, providing top-notch health, dental, and vision coverage with 100% company reimbursement.Competitive compensation, top-notch gym stipends, and generous equity grantsFlexible PTO policy that people actually use — on average, people take three weeks off per year401k match to help you save for your futurePaid lunches in the office, every day through Uber Eats and a free UberOne membership ($25).", "requirements": ["Data & Analytics", "Automated Execution", "Automated Portfolio Optimization & Management", "Experience in a fast-paced, engineering-focused organization.", "A mindset to challenge conventions and continuously improve.", "Willingness to build systems processing over 5 billion messages daily, ensuring reliability and scalability are paramount at Moment. These factors will significantly influence our product architecture and development.", "Ability to own large features and drive scaling efforts to deliver on our commitment to serve billions of investors globally.", "Design, develop, and maintain core Trading services that drive Moment's product offerings.", "Lead the scope definition, design, implementation, and deployment of robust distributed services, striking the appropriate balance between reliability, throughput, latency, resiliency, engineering velocity, and cost.", "Actively participate in design and architecture reviews for new features, products, or infrastructure components."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:14.800482"}, {"id": "view", "title": "Machine Learning Engineer - Early in Career", "company": "Splunk", "location": "California, United States", "url": "https://www.linkedin.com/jobs/view/machine-learning-engineer-early-in-career-at-splunk-4182143466", "description": "Splunk, a Cisco company, is building a safer and more resilient digital world with an end-to-end full stack platform made for a hybrid, multi-cloud world. Leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. Our customers love our technology, but it's our caring employees that make Splunk stand out as an amazing career destination. No matter where in the world or what level of the organization, we approach our work with kindness. So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you. Come help organizations be their best, while you reach new heights with a team that has your back.Role SummarySplunk is looking for Bachelor’s or Master's graduates to join our team! As a Machine Learning Engineer, you will work on a real project (or a few) and have an opportunity to enjoy our dynamic environment.You will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. Working to support internal and external customer needs, you will collaborate with multi-functional teams, receive mentorship, and gain insight into our values-driven process. Our goal is both to support your growth and development while empowering you for a successful start to your career.What you'll get to doIntegrate AI/ML solutions into Splunk products and servicesAchieve data science and software engineering goals set by you and your mentorLearn about Splunk, both the product and the companyCollaborate closely with software engineers, data scientists, and product managersMust-have QualificationsActively pursuing a Bachelor’s or Master's in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievementNice-to-have QualificationsWe’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.Coursework or research experience in artificial intelligence and machine learning topics such as time series analysis (univariate and multivariate), anomaly detection, generative AI technology and Large Language Models (LLM)Experience programming in a large software project – at school, professionally, or in an open source contextCoursework and project or internship experience in big data systems or distributed systemsExposure to ML frameworks (e.g., TensorFlow, PyTorch, Ray, vLLM) and PythonAbility to work well with others in a fast-paced environmentStrong communication skills, verbal and writtenEnthusiasm for solving interesting problemsSplunk is an Equal Opportunity EmployerSplunk, a Cisco company, is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis.NoteBase Pay RangeSF Bay Area, Seattle Metro, and New York City Metro AreaBase Pay Range $119,200.00 - 163,900.00 per yearCalifornia (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and MassachusettsBase Pay Range $107,280.00 - 147,510.00 per yearAll other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.Base Pay Range $95,360.00 - 131,120.00 per yearSplunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills and experience of the candidate.In addition to base pay, this role is eligible for incentive compensation and may be eligible for equity or long-term cash awards.Benefits are an important part of Splunk's Total Rewards package. This role is eligible for a competitive benefits package which includes medical, dental, vision, a 401(k) plan and match, paid time off and much more! Learn more about our next-level benefits at https //splunkbenefits.com.", "requirements": ["Integrate AI/ML solutions into Splunk products and services", "Achieve data science and software engineering goals set by you and your mentor", "Learn about Splunk, both the product and the company", "Collaborate closely with software engineers, data scientists, and product managers", "Actively pursuing a Bachelor’s or Master's in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement", "Coursework or research experience in artificial intelligence and machine learning topics such as time series analysis (univariate and multivariate), anomaly detection, generative AI technology and Large Language Models (LLM)", "Experience programming in a large software project – at school, professionally, or in an open source context", "Coursework and project or internship experience in big data systems or distributed systems", "Exposure to ML frameworks (e.g., TensorFlow, PyTorch, Ray, vLLM) and Python", "Ability to work well with others in a fast-paced environment"], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:20.267999"}, {"id": "view", "title": "Data Engineer (L5)", "company": "Netflix", "location": "United States", "url": "https://www.linkedin.com/jobs/view/data-engineer-l5-at-netflix-3982462774", "description": "Netflix is one of the world's leading entertainment services, with 283 million paid memberships in over 190 countries enjoying TV series, films and games across a wide variety of genres and languages. Members can play, pause and resume watching as much as they want, anytime, anywhere, and can change their plans at any time.At Netflix, our mission is to entertain the world. With 278 million paid members in over 190 countries on millions of devices; enjoying TV series, documentaries, and feature films across a wide variety of genres and languages - Netflix is reinventing entertainment from end to end. We are revolutionizing how shows and movies are produced, pushing technological boundaries to efficiently deliver streaming video at a massive scale over the internet, and continuously improving the end-to-end user experience with Netflix across their member journey.We pride ourselves on using data to inform our decision-making as we work towards our mission. This requires curating data across various domains such as Growth, Finance, Product, Content, and Studio. All of this data collection and curation is made possible thanks to the amazing Data Engineers of Netflix who bring this data to life.Data Engineering at Netflix is a role that requires building systems to process data efficiently and modeling the data to power analytics. These solutions can range from batch data pipelines that bring to life business metrics to real-time processing services that integrate with our core product features. In addition, we require our Data Engineers to have a rich understanding of large distributed systems on which our data solutions rely. Candidates should have knowledge across several of these skill sets and usually need to be deep in at least one. As a Data Engineer, you also need to have strong communication skills since you will need to collaborate with business, engineering, and data science teams to enable a culture of learning. Learn more about the work of data engineers at Netflix.Location of work: We are considering candidates who are willing to relocate to Los Gatos, California, as well as fully-remote candidates (remote in the US with occasional visits to Los Gatos) depending on the team your skills are most aligned with.Who are you?You strive to write elegant code, and you're comfortable with picking up new technologies independentlyYou are proficient in at least one major programming language (e.g. Java, Scala, Python) and comfortable working with SQLYou enjoy helping teams push the boundaries of analytical insights, creating new product features using data, and powering machine learning modelsYou have a strong background in at least one of the following: distributed data processing or software engineering of data services, or data modelingYou are familiar with big data technologies like Spark or Flink and comfortable working with web-scale datasetsYou have an eye for detail, good data intuition, and a passion for data qualityYou appreciate the importance of great documentation and data debugging skillsYou relate to and embody many of the aspects of the Netflix Culture. You love working independently while also collaborating and giving/receiving candid feedbackYou are comfortable working in a rapidly changing environment with ambiguous requirements. You are nimble and take intelligent risksOur compensation structure consists solely of an annual salary; we do not have bonuses. You choose each year how much of your compensation you want in salary versus stock options. To determine your personal top of market compensation, we rely on market indicators and consider your specific job family, background, skills, and experience to determine your compensation in the market range. The range for is $170,000 - $720,000.Netflix provides comprehensive benefits including Health Plans, Mental Health support, a 401(k) Retirement Plan with employer match, Stock Option Program, Disability Programs, Health Savings and Flexible Spending Accounts, Family-forming benefits, and Life and Serious Injury Benefits. We also offer paid leave of absence programs. Full-time hourly employees accrue 35 days annually for paid time off to be used for vacation, holidays, and sick paid time off. Full-time salaried employees are immediately entitled to flexible time off. See more detail about our Benefits here.Netflix is a unique culture and environment. Learn more here.Inclusion is a Netflix value and we strive to host a meaningful interview experience for all candidates. If you want an accommodation/adjustment for a disability or any other reason during the hiring process, please send a request to your recruiting partner.We are an equal-opportunity employer and celebrate diversity, recognizing that diversity builds stronger teams. We approach diversity and inclusion seriously and thoughtfully. We do not discriminate on the basis of race, religion, color, ancestry, national origin, caste, sex, sexual orientation, gender, gender identity or expression, age, disability, medical condition, pregnancy, genetic makeup, marital status, or military service.Job is open for no less than 7 days and will be removed when the position is filled.", "requirements": ["You strive to write elegant code, and you're comfortable with picking up new technologies independently", "You are proficient in at least one major programming language (e.g. Java, Scala, Python) and comfortable working with SQL", "You enjoy helping teams push the boundaries of analytical insights, creating new product features using data, and powering machine learning models", "You have a strong background in at least one of the following: distributed data processing or software engineering of data services, or data modeling", "You are familiar with big data technologies like Spark or Flink and comfortable working with web-scale datasets", "You have an eye for detail, good data intuition, and a passion for data quality", "You appreciate the importance of great documentation and data debugging skills", "You relate to and embody many of the aspects of the Netflix Culture. You love working independently while also collaborating and giving/receiving candid feedback", "You are comfortable working in a rapidly changing environment with ambiguous requirements. You are nimble and take intelligent risks"], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:26.390630"}, {"id": "view", "title": "Machine Learning Engineer", "company": "Adobe", "location": "San Jose, CA", "url": "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-adobe-4153748402", "description": "Our CompanyChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!The OpportunityAdobe is looking for a Machine Learning Engineer to understand and optimize the experience of Adobe’s Digital Experience customers. By partnering with Adobe Research and other business units, you will build products that transform how companies approach audience creation, journey optimization, and personalization at scale. Join a diverse, collaborative, and lively group of engineers and scientists well-established in the ML space. The work here is dynamic, fast-paced, creative, and data-driven.What You'll DoDevelop innovative models in collaboration with Adobe Research.Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.Engage in the product lifecycle, including architecture, design, deployment, and production operations.Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.What you need to succeedThe ideal candidate will have the following background:Bachelors in Computer Science, Data Science or Statistics with 2+ years of applied AI/ML experience, including developing, evaluating ML models, and deploying models into production or MS in Computer Science, Data Science, or a related field.Deep understanding of statistical modeling, machine learning, or analytics concepts, with a proven track record of solving problems using these methods.Experience in building large-scale data pipelines.Ability to quickly learn new skills and work in a fast-paced team.Proficiency in one or more programming languages such as Python, Scala, Java, or SQL.Proficiency in ML frameworks such as scikit-learn, SparkML, TensorFlow, or PyTorch.Experience working with both research and product teams.Excellent problem-solving and analytical skills.Excellent communication and relationship-building skills.Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $102,400 -- $196,300 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.Adobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.", "requirements": ["Develop innovative models in collaboration with Adobe Research.", "Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.", "Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.", "Engage in the product lifecycle, including architecture, design, deployment, and production operations.", "Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.", "Bachelors in Computer Science, Data Science or Statistics with 2+ years of applied AI/ML experience, including developing, evaluating ML models, and deploying models into production or MS in Computer Science, Data Science, or a related field.", "Deep understanding of statistical modeling, machine learning, or analytics concepts, with a proven track record of solving problems using these methods.", "Experience in building large-scale data pipelines.", "Ability to quickly learn new skills and work in a fast-paced team.", "Proficiency in one or more programming languages such as Python, Scala, Java, or SQL."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:33.103764"}, {"id": "view", "title": "Machine Learning Engineer", "company": "Adobe", "location": "San Jose, CA", "url": "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-adobe-4153743946", "description": "Our CompanyChanging the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen.We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours!The OpportunityAdobe is looking for a Machine Learning Engineer to understand and optimize the experience of Adobe’s Digital Experience customers. By partnering with Adobe Research and other business units, you will build products that transform how companies approach audience creation, journey optimization, and personalization at scale. Join a diverse, collaborative, and lively group of engineers and scientists well-established in the ML space. The work here is dynamic, fast-paced, creative, and data-driven.What You'll DoDevelop innovative models in collaboration with Adobe Research.Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.Engage in the product lifecycle, including architecture, design, deployment, and production operations.Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.What you need to succeedThe ideal candidate will have the following background:MS in Computer Science, Data Science or Statistics with 3+ years of applied AI/ML experience, including developing, evaluating ML models, and deploying models into production or PhD degree in Computer Science, Data Science, or a related field.Deep understanding of statistical modeling, machine learning, or analytics concepts, with a proven track record of solving problems using these methods.Experience in building large-scale data pipelines.Ability to quickly learn new skills and work in a fast-paced team.Proficiency in one or more programming languages such as Python, Scala, Java, or SQL.Proficiency in ML frameworks such as scikit-learn, SparkML, TensorFlow, or PyTorch.Experience working with both research and product teams.Excellent problem-solving and analytical skills.Excellent communication and relationship-building skills.Our compensation reflects the cost of labor across several  U.S. geographic markets, and we pay differently based on those defined markets. The U.S. pay range for this position is $120,700 -- $228,600 annually. Pay within this range varies by work location and may also depend on job-related knowledge, skills, and experience. Your recruiter can share more about the specific salary range for the job location during the hiring process.At Adobe, for sales roles starting salaries are expressed as total target compensation (TTC = base + commission), and short-term incentives are in the form of sales commission plans. Non-sales roles starting salaries are expressed as base salary and short-term incentives are in the form of the Annual Incentive Plan (AIP).In addition, certain roles may be eligible for long-term incentives in the form of a new hire equity award.Adobe will consider qualified applicants with arrest or conviction records for employment in accordance with state and local laws and “fair chance” ordinances.Adobe is proud to be an Equal Employment Opportunity and affirmative action employer. We do not discriminate based on gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, veteran status, or any other applicable characteristics protected by law. Learn more.Adobe aims to make Adobe.com accessible to any and all users. If you have a disability or special need that requires accommodation to navigate our website or complete the application process, email accommodations@adobe.com or call (408) 536-3015.Adobe values a free and open marketplace for all employees and has policies in place to ensure that we do not enter into illegal agreements with other companies to not recruit or hire each other’s employees.", "requirements": ["Develop innovative models in collaboration with Adobe Research.", "Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.", "Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.", "Engage in the product lifecycle, including architecture, design, deployment, and production operations.", "Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.", "MS in Computer Science, Data Science or Statistics with 3+ years of applied AI/ML experience, including developing, evaluating ML models, and deploying models into production or PhD degree in Computer Science, Data Science, or a related field.", "Deep understanding of statistical modeling, machine learning, or analytics concepts, with a proven track record of solving problems using these methods.", "Experience in building large-scale data pipelines.", "Ability to quickly learn new skills and work in a fast-paced team.", "Proficiency in one or more programming languages such as Python, Scala, Java, or SQL."], "salary": "Mentioned in description", "is_remote": false, "extracted_skills": [], "level": "Not specified", "timestamp": "2025-04-28T02:37:39.631237"}]