["## 🚀 **Data Scientist (L5) - Content**\n### 🏢 Netflix\n\n📍 United States\n\n**Requirements:**\n• Be a strategic thought partner with business stakeholders to define high impact problems and innovative ways to solve them with data.\n• Develop statistical models explaining TUDUM engagement, impact, and other key behavioral patterns and drive causal inferences between TUDUM and the engagement with other netflix channels\n• Translate insights into actionable recommendations for business improvement, and communicate these findings clearly to a broad audience\n• Identify and proactively socialize TUDUM insights, especially those that may be impactful to other business areas\n• Exceptional interpersonal and communication skills to influence stakeholders using clear insights and recommendations\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-scientist-l5-content-at-netflix-4179694651\n\n---\n\n", "## 🚀 **Data Scientist (L5) - Netflix Preview Club**\n### 🏢 Netflix\n\n📍 United States\n\n**Requirements:**\n• Collaborate closely with data scientists, consumer insights scientists, engineers, strategy partners, and our content teams to deliver insights through statistical modeling that drive key decisions.\n• Develop measurement frameworks and statistical modeling frameworks in a mixed behavioral and survey context, to aid stakeholders in making complex, creative decisions.\n• Be a strategic thought partner with stakeholders to define high-impact analytical problems and innovative ways to solve them with data.\n• Drive product innovation through robust measurement strategies in experimentation, modeling, and analytics.\n• Lead the design, analysis, and interpretation of experiments that shape the future of content analytics.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-scientist-l5-netflix-preview-club-at-netflix-4211646000\n\n---\n\n", "## 🚀 **Data Scientist, GTM**\n### 🏢 Notion\n\n📍 San Francisco, CA\n\n**Requirements:**\n• You will partner with Revenue Operations and Sales leads, driving forward all data science and analytics work in their functional areas\n• You will transform complex data into compelling insights, synthesizing them into crisp narratives for senior leadership that drive measurable business change (Insights are useful. Impact is even better!)\n• You will build and maintain KPI dashboards that teams rely on for critical decision-making, along with self-service tools that empower business partners\n• You will develop models that become core to our operations, such as optimizing sales outreach strategies or building a sales forecasting model\n• You will collaborate closely with our Data Engineering and Business Systems teams to build high-fidelity, canonical customer data pipelines that serve as the foundation for GTM analytics\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-scientist-gtm-at-notion-4214365517\n\n---\n\n", "## 🚀 **Data Scientist (L5) - Member Algorithm Foundations**\n### 🏢 Netflix\n\n📍 United States\n\n**Requirements:**\n• Be a strong thought partner influencing strategic decision-making through data-driven insights and recommendations.\n• Proactively identify and perform data exploration to inform future product directions.\n• Make data-driven recommendations for opportunities, prioritization, and resource allocation.\n• Understand where various opportunities fit into the broader strategies and prioritize competing demands to ensure the most impactful items.\n• Effectively identify and leverage machine learning, experimentation, and other analysis techniques, as appropriate, to solve business problems.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-scientist-l5-member-algorithm-foundations-at-netflix-4138391092\n\n---\n\n", "## 🚀 **Data Scientist**\n### 🏢 Warner Music Group\n\n📍 New York, NY\n\n**Requirements:**\n• Curiosity: We do our best work when we’re immersing ourselves in culture and breaking through barriers. Curiosity is the driving force behind creativity and ingenuity. It fuels innovation, and innovation is the key to our future.\n• Collaboration: Making music and bringing it to the world is all about the power of originality amplified by teamwork. A great idea, like a great song, travels globally. We ignite passions and build connections across our diverse community of artists, songwriters, partners, and fans.\n• Commitment: We pursue excellence for our team and our talent. Everything in music starts with a leap into the unknown, and we’re committed to keeping the faith, acting with integrity, and delivering on our promises.\n• Lead data science projects from inception to completion on topics such as subscriber consumption and revenue forecasts, digital advertising forecasts, global trends analysis, business performance trends, and more.\n• Apply advanced data analysis and statistical modeling techniques to address complex business challenges. Develop and maintain production-level models, ensuring accuracy and efficiency.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-scientist-at-warner-music-group-4197998463\n\n---\n\n", "## 🚀 **Software Engineer**\n### 🏢 Moment\n\n📍 New York City Metropolitan Area\n\n**Requirements:**\n• Data & Analytics\n• Automated Execution\n• Automated Portfolio Optimization & Management\n• Experience in a fast-paced, engineering-focused organization.\n• A mindset to challenge conventions and continuously improve.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/software-engineer-at-moment-4194409845\n\n---\n\n", "## 🚀 **Machine Learning Engineer - Early in Career**\n### 🏢 Splunk\n\n📍 California, United States\n\n**Requirements:**\n• Integrate AI/ML solutions into Splunk products and services\n• Achieve data science and software engineering goals set by you and your mentor\n• Learn about Splunk, both the product and the company\n• Collaborate closely with software engineers, data scientists, and product managers\n• Actively pursuing a Bachelor’s or Master's in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/machine-learning-engineer-early-in-career-at-splunk-4182143466\n\n---\n\n", "## 🚀 **Data Engineer (L5)**\n### 🏢 Netflix\n\n📍 United States\n\n**Requirements:**\n• You strive to write elegant code, and you're comfortable with picking up new technologies independently\n• You are proficient in at least one major programming language (e.g. Java, Scala, Python) and comfortable working with SQL\n• You enjoy helping teams push the boundaries of analytical insights, creating new product features using data, and powering machine learning models\n• You have a strong background in at least one of the following: distributed data processing or software engineering of data services, or data modeling\n• You are familiar with big data technologies like Spark or Flink and comfortable working with web-scale datasets\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/data-engineer-l5-at-netflix-3982462774\n\n---\n\n", "## 🚀 **Machine Learning Engineer**\n### 🏢 Adobe\n\n📍 San Jose, CA\n\n**Requirements:**\n• Develop innovative models in collaboration with Adobe Research.\n• Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.\n• Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.\n• Engage in the product lifecycle, including architecture, design, deployment, and production operations.\n• Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/machine-learning-engineer-at-adobe-4153748402\n\n---\n\n", "## 🚀 **Machine Learning Engineer**\n### 🏢 Adobe\n\n📍 San Jose, CA\n\n**Requirements:**\n• Develop innovative models in collaboration with Adobe Research.\n• Design, develop, and deploy applications powered by predictive and generative models, with a focus on building autonomous agents and using agentic frameworks for adaptive decision-making.\n• Implement ML-Ops best practices to ensure scalable, reliable, and efficient machine learning workflows.\n• Engage in the product lifecycle, including architecture, design, deployment, and production operations.\n• Understand data to make recommendations for the right predictive models, quality metrics, and governance approaches.\n\n💰 **Salary:** Mentioned in description\n\n**Level:** ⚙️ Mid-level\n\n**Apply here:** https://www.linkedin.com/jobs/view/machine-learning-engineer-at-adobe-4153743946\n\n---\n\n"]